resources/benchmark/synthetic/lb/ambient-l4.txt
yizhengx@node0:~$ service0_ip=$(kubectl get svc service0 -o jsonpath='{.spec.clusterIP}'); ~/istio-1.26.0/wrk2/wrk -t4 -c16 -R 50 -d 30 -L http://$service0_ip/endpoint1
Running 30s test @ http://10.97.71.80/endpoint1
  4 threads and 16 connections
  Thread calibration: mean lat.: 86.529ms, rate sampling interval: 228ms
  Thread calibration: mean lat.: 82.344ms, rate sampling interval: 228ms
  Thread calibration: mean lat.: 80.110ms, rate sampling interval: 228ms
  Thread calibration: mean lat.: 68.909ms, rate sampling interval: 228ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    79.97ms   43.49ms 117.18ms   62.87%
    Req/Sec    12.01      5.44    17.00     83.05%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%  112.96ms
 75.000%  113.66ms
 90.000%  114.18ms
 99.000%  115.52ms
 99.900%  117.25ms
 99.990%  117.25ms
 99.999%  117.25ms
100.000%  117.25ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

      21.631     0.000000            1         1.00
      23.007     0.100000          101         1.11
      23.439     0.200000          201         1.25
      23.807     0.300000          302         1.43
     111.359     0.400000          402         1.67
     112.959     0.500000          508         2.00
     113.151     0.550000          564         2.22
     113.279     0.600000          602         2.50
     113.407     0.650000          652         2.86
     113.535     0.700000          707         3.33
     113.663     0.750000          767         4.00
     113.727     0.775000          801         4.44
     113.791     0.800000          827         5.00
     113.791     0.825000          827         5.71
     113.919     0.850000          857         6.67
     114.047     0.875000          882         8.00
     114.111     0.887500          901         8.89
     114.175     0.900000          914        10.00
     114.239     0.912500          928        11.43
     114.239     0.925000          928        13.33
     114.367     0.937500          949        16.00
     114.367     0.943750          949        17.78
     114.431     0.950000          952        20.00
     114.495     0.956250          959        22.86
     114.559     0.962500          970        26.67
     114.623     0.968750          974        32.00
     114.623     0.971875          974        35.56
     114.751     0.975000          979        40.00
     114.815     0.978125          981        45.71
     115.007     0.981250          985        53.33
     115.071     0.984375          987        64.00
     115.199     0.985938          988        71.11
     115.327     0.987500          991        80.00
     115.519     0.989062          992        91.43
     115.647     0.990625          993       106.67
     115.903     0.992188          996       128.00
     115.903     0.992969          996       142.22
     115.903     0.993750          996       160.00
     115.967     0.994531          997       182.86
     116.031     0.995313         1000       213.33
     116.031     0.996094         1000       256.00
     116.031     0.996484         1000       284.44
     116.031     0.996875         1000       320.00
     116.031     0.997266         1000       365.71
     116.031     0.997656         1000       426.67
     117.247     0.998047         1002       512.00
     117.247     1.000000         1002          inf
#[Mean    =       79.973, StdDeviation   =       43.493]
#[Max     =      117.184, Total count    =         1002]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  1504 requests in 30.02s, 233.53KB read
Requests/sec:     50.09
Transfer/sec:      7.78KB
yizhengx@node0:~$ 


yizhengx@node0:~$ kubectl logs service1-7b49bf6b7d-sg2xx    | wc -l
567
yizhengx@node0:~$ kubectl logs service1-busy-6457fcbd4b-nmsp4  | wc -l
943