resources/benchmark/synthetic/lb/ambient-l7.txt
yizhengx@node0:~$ service0_ip=$(kubectl get svc service0 -o jsonpath='{.spec.clusterIP}'); ~/istio-1.26.0/wrk2/wrk -t4 -c16 -R 50 -d 30 -L http://$service0_ip/endpoint1
Running 30s test @ http://10.102.212.52/endpoint1
  4 threads and 16 connections
  Thread calibration: mean lat.: 73.809ms, rate sampling interval: 233ms
  Thread calibration: mean lat.: 68.196ms, rate sampling interval: 232ms
  Thread calibration: mean lat.: 67.773ms, rate sampling interval: 232ms
  Thread calibration: mean lat.: 63.879ms, rate sampling interval: 232ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    66.32ms   44.87ms 118.78ms   54.71%
    Req/Sec    12.08      5.44    17.00     82.80%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   26.66ms
 75.000%  115.65ms
 90.000%  116.29ms
 99.000%  117.50ms
 99.900%  118.59ms
 99.990%  118.85ms
 99.999%  118.85ms
100.000%  118.85ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

      21.535     0.000000            1         1.00
      24.751     0.100000          100         1.11
      25.343     0.200000          201         1.25
      25.695     0.300000          301         1.43
      26.063     0.400000          403         1.67
      26.655     0.500000          499         2.00
     112.575     0.550000          550         2.22
     114.623     0.600000          603         2.50
     115.071     0.650000          652         2.86
     115.391     0.700000          704         3.33
     115.647     0.750000          751         4.00
     115.839     0.775000          785         4.44
     115.903     0.800000          807         5.00
     115.967     0.825000          828         5.71
     116.095     0.850000          862         6.67
     116.159     0.875000          875         8.00
     116.223     0.887500          893         8.89
     116.287     0.900000          904        10.00
     116.351     0.912500          912        11.43
     116.415     0.925000          926        13.33
     116.543     0.937500          937        16.00
     116.607     0.943750          942        17.78
     116.735     0.950000          952        20.00
     116.799     0.956250          955        22.86
     116.927     0.962500          964        26.67
     116.991     0.968750          967        32.00
     117.055     0.971875          973        35.56
     117.119     0.975000          976        40.00
     117.183     0.978125          978        45.71
     117.247     0.981250          981        53.33
     117.311     0.984375          984        64.00
     117.311     0.985938          984        71.11
     117.375     0.987500          986        80.00
     117.503     0.989062          988        91.43
     117.567     0.990625          989       106.67
     117.695     0.992188          991       128.00
     117.695     0.992969          991       142.22
     117.951     0.993750          992       160.00
     118.143     0.994531          994       182.86
     118.143     0.995313          994       213.33
     118.527     0.996094          996       256.00
     118.527     0.996484          996       284.44
     118.527     0.996875          996       320.00
     118.527     0.997266          996       365.71
     118.527     0.997656          996       426.67
     118.591     0.998047          997       512.00
     118.591     0.998242          997       568.89
     118.591     0.998437          997       640.00
     118.591     0.998633          997       731.43
     118.591     0.998828          997       853.33
     118.847     0.999023          998      1024.00
     118.847     1.000000          998          inf
#[Mean    =       66.325, StdDeviation   =       44.867]
#[Max     =      118.784, Total count    =          998]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  1504 requests in 30.03s, 233.53KB read
Requests/sec:     50.09
Transfer/sec:      7.78KB
yizhengx@node0:~$ 

yizhengx@node0:~$ kubectl logs service1-7b49bf6b7d-jt8zb | wc -l
826
yizhengx@node0:~$ kubectl logs service1-busy-6457fcbd4b-98hkk | wc -l
684