resources/benchmark/synthetic/lb/istio-l4.txt
service0_ip=$(kubectl get svc service0 -o jsonpath='{.spec.clusterIP}'); ~/istio-1.26.0/wrk2/wrk -t4 -c16 -R 50 -d 30 -L http://$service0_ip/endpoint1
Running 30s test @ http://10.100.170.101/endpoint1
  4 threads and 16 connections
  Thread calibration: mean lat.: 68.514ms, rate sampling interval: 228ms
  Thread calibration: mean lat.: 66.989ms, rate sampling interval: 228ms
  Thread calibration: mean lat.: 67.913ms, rate sampling interval: 228ms
  Thread calibration: mean lat.: 69.316ms, rate sampling interval: 228ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    68.86ms   45.02ms 116.54ms   49.10%
    Req/Sec    11.93      4.99    17.00     91.67%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%  110.78ms
 75.000%  113.73ms
 90.000%  114.18ms
 99.000%  115.07ms
 99.900%  116.29ms
 99.990%  116.61ms
 99.999%  116.61ms
100.000%  116.61ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

      20.991     0.000000            1         1.00
      22.927     0.100000          101         1.11
      23.375     0.200000          202         1.25
      23.727     0.300000          306         1.43
      24.047     0.400000          400         1.67
     110.783     0.500000          500         2.00
     112.191     0.550000          552         2.22
     113.087     0.600000          607         2.50
     113.343     0.650000          655         2.86
     113.535     0.700000          714         3.33
     113.727     0.750000          770         4.00
     113.791     0.775000          794         4.44
     113.855     0.800000          821         5.00
     113.919     0.825000          842         5.71
     113.983     0.850000          862         6.67
     114.047     0.875000          875         8.00
     114.111     0.887500          890         8.89
     114.175     0.900000          907        10.00
     114.239     0.912500          923        11.43
     114.303     0.925000          935        13.33
     114.367     0.937500          940        16.00
     114.431     0.943750          952        17.78
     114.431     0.950000          952        20.00
     114.495     0.956250          965        22.86
     114.495     0.962500          965        26.67
     114.559     0.968750          971        32.00
     114.623     0.971875          973        35.56
     114.687     0.975000          976        40.00
     114.879     0.978125          984        45.71
     114.879     0.981250          984        53.33
     114.943     0.984375          985        64.00
     115.007     0.985938          989        71.11
     115.007     0.987500          989        80.00
     115.071     0.989062          993        91.43
     115.071     0.990625          993       106.67
     115.071     0.992188          993       128.00
     115.071     0.992969          993       142.22
     115.135     0.993750          994       160.00
     115.327     0.994531          995       182.86
     115.455     0.995313          996       213.33
     115.711     0.996094          997       256.00
     115.711     0.996484          997       284.44
     115.711     0.996875          997       320.00
     116.095     0.997266          998       365.71
     116.095     0.997656          998       426.67
     116.287     0.998047          999       512.00
     116.287     0.998242          999       568.89
     116.287     0.998437          999       640.00
     116.287     0.998633          999       731.43
     116.287     0.998828          999       853.33
     116.607     0.999023         1000      1024.00
     116.607     1.000000         1000          inf
#[Mean    =       68.859, StdDeviation   =       45.016]
#[Max     =      116.544, Total count    =         1000]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  1504 requests in 30.03s, 233.53KB read
Requests/sec:     50.09
Transfer/sec:      7.78KB
yizhengx@node0:~$ 

yizhengx@node0:~$ kubectl logs service1-7b49bf6b7d-6h4tp  | wc -l
757
yizhengx@node0:~$ kubectl logs service1-busy-6457fcbd4b-4wnnv  | wc -l
753